app/views/plates/_form.html.erb

                  <%= image_tag badge.image.url(:thumb) %>
                  <%= check_box_tag "plate[plate_badge_ids][]", badge.id, @plate.plate_badges.include?(badge), {class: ''} %>
---
SELECT  1 AS one FROM `plate_badges` INNER JOIN `plate_badges_plates` ON `plate_badges`.`id` = `plate_badges_plates`.`plate_badge_id` WHERE `plate_badges_plates`.`plate_id` = 1 AND `plate_badges`.`id` = 1 LIMIT 1
SELECT `plate_badges`.* FROM `plate_badges`

<script type="text/javascript">
  window.addEventListener('load', function(){
    $('.summernote').each(function(){
      //$(this).summernote({height:300});
    });

    /* INGREDIENTES */
    var ingredientsList = <%= raw(@ingredients_list.to_json) %>;
    var plateIngredientsList = <%= raw(@plate_ingredients_list.to_json) %>;

    var tagsIngredients = $('[data-role="ingredientsTags"]');
    tagsIngredients.tagsinput({
      itemValue: 'value',
      itemText: 'text',
      allowDuplicates: false,
      onTagExists: function(item, $tag) {
        setTimeout(function(){
          tagsIngredients.tagsinput('input').val('');
        }, 50);
      },
      typeahead: {
        name: 'ingredients',
---
SELECT `ingredients`.* FROM `ingredients`