app/views/plates/show.html.erb

            <div class="col-lg-9">
              <label for="number" class="form-control-static"><%= @plate.plate_badges.collect {|b| b.name}.join(', ') %></label>
---
SELECT `plate_badges`.* FROM `plate_badges` INNER JOIN `plate_badges_plates` ON `plate_badges`.`id` = `plate_badges_plates`.`plate_badge_id` WHERE `plate_badges_plates`.`plate_id` = 1

            <div class="col-lg-9">
              <label for="number" class="form-control-static"><%= @plate.ingredients.collect {|i| i.name}.join(', ') %></label>
---
SELECT `ingredients`.* FROM `ingredients` INNER JOIN `ingredients_plates` ON `ingredients`.`id` = `ingredients_plates`.`ingredient_id` WHERE `ingredients_plates`.`plate_id` = 1