app/views/chefs/_form.html.erb

SELECT `chef_types`.* FROM `chef_types`
---
              <%= f.label 'Tipo do Chefe*' %><br>
              <%= f.select :chef_type_id, ChefType.all.collect {|chef_type| [ chef_type.name, chef_type.id ] }, { prompt: 'Selecione o Tipo do Chef' }, :class => 'form-control m-bot15' %>

SELECT `countries`.* FROM `countries`
---
              <%= f.label 'País*' %><br>
              <%= f.select :country_id, Country.all.collect {|country| [ country.name, country.id ] }, { prompt: 'Selecione o País' }, :class => 'form-control m-bot15' %>

SELECT `badges`.* FROM `badges`
---
              <div class="row">
                <% Badge.all.each do |badge| %>