app/views/chefs/show.html.erb

SELECT `badges`.* FROM `badges` INNER JOIN `badges_chefs` ON `badges`.`id` = `badges_chefs`.`badge_id` WHERE `badges_chefs`.`chef_id` = 1
---
            <div class="row">
              <% @chef.badges.collect do |b| %>