app/views/daily_menus/index.html.erb

                  <td><%= plate.available_quantity %></td>
                  <td><%= plate.plate_accompaniments.collect { |a| a.name }.join(', ') %></td>
---
SELECT `plates`.* FROM `plates` WHERE (monday_available)