app/views/roles/show.html.erb

                  <li class="list-group-item active "><%= entity.name %></li>
                    <% entity.permissions.each do |permission| %>
---
SELECT `permissions`.* FROM `permissions` INNER JOIN `permissions_roles` ON `permissions`.`id` = `permissions_roles`.`permission_id` WHERE `permissions_roles`.`role_id` = 2

              <% else %>
                <% Entity.where.not(is_dev: true).collect { |entity| entity }.each do |entity| %>
---
SELECT `entities`.* FROM `entities` WHERE (`entities`.`is_dev` != 1)