app/controllers/addresses_controller.rb

  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save
        format.html { redirect_to chefs_url, notice: "Endereço Adicionado com Sucesso ao Chefe: #{@address.chef.name }." }
      else
        @chefs = Chef.all
---
SELECT `chefs`.* FROM `chefs`