app/controllers/badges_controller.rb

  def index
    @badges = Badge.all
---
SELECT `badges`.* FROM `badges`

  def create
    @badge = Badge.new(badge_params)

    respond_to do |format|
      if @badge.save
---
INSERT INTO `badges` (`name`, `description`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `created_at`, `updated_at`) VALUES ('teste', 'teste', '1512607_566888866724707_2061933304_n.jpg', 'image/jpeg', 20301, '2016-03-28 02:33:40', '2016-03-28 02:33:40', '2016-03-28 02:33:40')

    def set_badge
      @badge = Badge.find(params[:id])
---
SELECT  `badges`.* FROM `badges` WHERE `badges`.`id` = 1 LIMIT 1