app/controllers/chefs_controller.rb

  def index
    @address = Address.new
    @chefs = Chef.all
---
SELECT `chefs`.* FROM `chefs`

  def create
    badges = Badge.where(id: params[:badge_ids])
    @chef = Chef.new(chef_params)
    @chef.badges << badges
---
SELECT `badges`.* FROM `badges` WHERE `badges`.`id` IS NULL
INSERT INTO `chefs` (`name`, `description`, `cpf`, `rg`, `born_date`, `country_id`, `email`, `phone_one`, `phone_two`, `specialty`, `naturalness`, `academic_education`, `university`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`, `chef_type_id`, `created_at`, `updated_at`) VALUES ('diogo', 'teste', '999.999.999-99', '2222', '2016-03-23', 1, 'diogo@gmail.com', '(22) 22222-2222', '(44) 44444-4444', 'foda', 'brasileiro', 'pro', 'ufrpe', '1512607_566888866724707_2061933304_n.jpg', 'image/jpeg', 20301, '2016-03-28 12:14:37', 1, '2016-03-28 12:14:38', '2016-03-28 12:14:38')

  def update
    badges = Badge.where(id: params[:badge_ids])
    @chef.badges << badges
    respond_to do |format|
      if @chef.update(chef_params)
---
SELECT `badges`.* FROM `badges` WHERE `badges`.`id` IN (1, 2)
UPDATE `chefs` SET `active` = 0, `updated_at` = '2016-03-28 12:15:43' WHERE `chefs`.`id` = 1

  def destroy
    @chef.destroy
---
DELETE FROM `chefs` WHERE `chefs`.`id` = 1

    def set_chef
      @chef = Chef.find(params[:id])
---
SELECT  `chefs`.* FROM `chefs` WHERE `chefs`.`id` = 1 LIMIT 1