app/controllers/chef_types_controller.rb

  def index
    @chef_types = ChefType.all
---
SELECT `chef_types`.* FROM `chef_types`

  def create
    @chef_type = ChefType.new(chef_type_params)

    respond_to do |format|
      if @chef_type.save
---
INSERT INTO `chef_types` (`name`, `created_at`, `updated_at`) VALUES ('teste', '2016-03-28 12:09:10', '2016-03-28 12:09:10')

    def set_chef_type
      @chef_type = ChefType.find(params[:id])
---
SELECT  `chef_types`.* FROM `chef_types` WHERE `chef_types`.`id` = 1 LIMIT 1