app/controllers/countries_controller.rb

SELECT `countries`.* FROM `countries`
---
  def index
    @countries = Country.all

INSERT INTO `countries` (`name`, `initials`, `created_at`, `updated_at`) VALUES ('Brazil', 'BR', '2016-03-26 00:28:25', '2016-03-26 00:28:25')
---
  def create
    @country = Country.new(country_params)

    respond_to do |format|
      if @country.save

SELECT  `countries`.* FROM `countries` WHERE `countries`.`id` = 1 LIMIT 1
---
    def set_country
      @country = Country.find(params[:id])