app/controllers/daily_menus_controller.rb

SELECT `plates`.* FROM `plates` WHERE (monday_available)
---
  def index
    @term = params[:term]
    @where = []
    @where << "id = :term"
    @where = @where.join(" OR ")
    @daily_menus = DailyMenu.where(@where, term: "%#{params[:term]}%").paginate(:page => params[:page], :per_page => 10)
    @plates = Plate.where(get_today_plate_tag.to_s, 1)