app/controllers/ingredients_controller.rb

SELECT `ingredients`.* FROM `ingredients`
---
  def index
    @ingredients = Ingredient.all

INSERT INTO `ingredients` (`name`, `created_at`, `updated_at`) VALUES ('leite', '2016-03-26 00:16:43', '2016-03-26 00:16:43')
---
  def create
    @ingredient = Ingredient.new(ingredient_params)

    respond_to do |format|
      if @ingredient.save

SELECT  `ingredients`.* FROM `ingredients` WHERE `ingredients`.`id` = 1 LIMIT 1
---
    def set_ingredient
      @ingredient = Ingredient.find(params[:id])