app/controllers/plates_controller.rb

  def index
    @plates = Plate.all
---
SELECT `plates`.* FROM `plates`

  def new
    @plate = Plate.new
    @types = PlateType.all
    @badges = PlateBadge.all
    @chefs = Chef.all
    @ingredients_list = Ingredient.all.map { |i| {text: i.name, value: i.id}}
    @plate_ingredients_list = @plate.ingredients.map { |i| {text: i.name, value: i.id} }
    @accompaniments_list = PlateAccompaniment.all.map { |p| {text: p.name, value: p.id}}
---
SELECT `plate_types`.* FROM `plate_types`
SELECT `plate_badges`.* FROM `plate_badges`
SELECT `chefs`.* FROM `chefs`
SELECT `ingredients`.* FROM `ingredients`
SELECT `plate_accompaniments`.* FROM `plate_accompaniments`

  def edit
    @types = PlateType.all
---
SELECT `plate_types`.* FROM `plate_types`

  def create
    @plate = Plate.new(plate_params)
    @types = PlateType.all
    @badges = PlateBadge.all

    respond_to do |format|
      if @plate.save
---
INSERT INTO `plates` (`title`, `description`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`, `chef_id`, `plate_type_id`, `created_at`, `updated_at`) VALUES ('macarrão a bolonhesa', 'massa', '47106-coimbra-portugal-1366x768-world-wallpaper.jpg', 'image/jpeg', 915721, '2016-03-26 00:31:01', 1, 1, '2016-03-26 00:31:01', '2016-03-26 00:31:01')

  def update
    respond_to do |format|
      if @plate.update(plate_params)
---
UPDATE `plates` SET `photo_file_name` = '1512607_566888866724707_2061933304_n.jpg', `photo_content_type` = 'image/jpeg', `photo_file_size` = 20301, `photo_updated_at` = '2016-03-28 13:25:01', `updated_at` = '2016-03-28 13:25:02' WHERE `plates`.`id` = 1

    def set_plate
      @plate = Plate.find(params[:id])
      @types = PlateType.all
      @badges = PlateBadge.all
      @chefs = Chef.all
      @ingredients_list = Ingredient.all.map { |i| {text: i.name, value: i.id}}
      @plate_ingredients_list = @plate.ingredients.map { |i| {text: i.name, value: i.id} }
      @accompaniments_list = PlateAccompaniment.all.map { |p| {text: p.name, value: p.id}}
      @plate_accompaniments_list = @plate.plate_accompaniments.map { |p| {text: p.name, value: p.id} }
---
SELECT  `plates`.* FROM `plates` WHERE `plates`.`id` = 1 LIMIT 1
SELECT `plate_badges`.* FROM `plate_badges`
SELECT `chefs`.* FROM `chefs`
SELECT `ingredients`.* FROM `ingredients`
SELECT `ingredients`.* FROM `ingredients` INNER JOIN `ingredients_plates` ON `ingredients`.`id` = `ingredients_plates`.`ingredient_id` WHERE `ingredients_plates`.`plate_id` = 1
SELECT `plate_accompaniments`.* FROM `plate_accompaniments`
SELECT  `plate_accompaniments`.* FROM `plate_accompaniments` WHERE `plate_accompaniments`.`id` = 1 LIMIT 1