app/controllers/plate_accompaniments_controller.rb

SELECT `plate_accompaniments`.* FROM `plate_accompaniments`
---
  def index
    @plate_accompaniments = PlateAccompaniment.all

INSERT INTO `plate_accompaniments` (`name`, `created_at`, `updated_at`) VALUES ('arroz', '2016-03-26 00:17:08', '2016-03-26 00:17:08')
---
  def create
    @plate_accompaniment = PlateAccompaniment.new(plate_accompaniment_params)

    respond_to do |format|
      if @plate_accompaniment.save

SELECT  `plate_accompaniments`.* FROM `plate_accompaniments` WHERE `plate_accompaniments`.`id` = 1 LIMIT 1
---
    def set_plate_accompaniment
      @plate_accompaniment = PlateAccompaniment.find(params[:id])