app/controllers/plate_badges_controller.rb

SELECT `plate_badges`.* FROM `plate_badges`
---
  def index
    @plate_badges = PlateBadge.all

INSERT INTO `plate_badges` (`name`, `description`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `created_at`, `updated_at`) VALUES ('teste', 'teste', '1512607_566888866724707_2061933304_n.jpg', 'image/jpeg', 20301, '2016-03-28 13:03:59', '2016-03-28 13:03:59', '2016-03-28 13:03:59')
---
  def create
    @plate_badge = PlateBadge.new(plate_badge_params)

    respond_to do |format|
      if @plate_badge.save

UPDATE `plate_badges` SET `image_file_name` = '1512607_566888866724707_2061933304_n.jpg', `image_content_type` = 'image/jpeg', `image_file_size` = 20301, `image_updated_at` = '2016-03-26 00:21:06', `updated_at` = '2016-03-26 00:21:06' WHERE `plate_badges`.`id` = 1
---
  def update
    respond_to do |format|
      if @plate_badge.update(plate_badge_params)

SELECT  `plate_badges`.* FROM `plate_badges` WHERE `plate_badges`.`id` = 1 LIMIT 1
---
    def set_plate_badge
      @plate_badge = PlateBadge.find(params[:id])