app/controllers/plate_types_controller.rb

  def index
    @plate_types = PlateType.all
---
SELECT `plate_types`.* FROM `plate_types`

  def create
    @plate_type = PlateType.new(plate_type_params)

    respond_to do |format|
      if @plate_type.save
---
INSERT INTO `plate_types` (`name`, `created_at`, `updated_at`) VALUES ('principal', '2016-03-26 00:29:45', '2016-03-26 00:29:45')

    def set_plate_type
      @plate_type = PlateType.find(params[:id])
---
SELECT  `plate_types`.* FROM `plate_types` WHERE `plate_types`.`id` = 1 LIMIT 1