app/controllers/plates_controller.rb

INSERT INTO `plate_accompaniments_plates` (`plate_accompaniment_id`, `plate_id`) VALUES (1, 1)
---
  def create
    @plate = Plate.new(plate_params_with_ingredients_and_accompaniments)
    @plate.plate_badges.clear
    @types = PlateType.all
    @badges = PlateBadge.all
    @chefs = Chef.where('active = 1')

    respond_to do |format|
      if @plate.save