app/controllers/roles_controller.rb

  def update
    @role.permission_ids = params[:permission_ids]
    respond_to do |format|
      if @role.update(role_params)
---
UPDATE `roles` SET `name` = 'Teste casa', `updated_at` = '2016-03-28 14:45:52' WHERE `roles`.`id` = 2

    def set_role
      @role = Role.find(params[:id])
---
SELECT  `roles`.* FROM `roles` WHERE `roles`.`id` = 2 LIMIT 1