app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`role_id`, `name`, `email`, `encrypted_password`, `created_at`, `updated_at`) VALUES (2, 'casa', 'casa@casa.com', '$2a$10$jWFbBv44azw2GjwIIQFZWORMmNFCu.p4cvcc5aa2Yniwld9ajjaFK', '2016-03-28 11:28:09', '2016-03-28 11:28:09')

  def update_password

    id = params['user'][:id];
    id ||= current_user.id
    @user = User.find(id)

    if @user.update_with_password(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `encrypted_password` = '$2a$10$.BhgyxTArs.bRm2KqTlaYebd6yRZBle96rgz1guj9xd1mm9p8S55K', `updated_at` = '2016-03-29 18:38:10' WHERE `users`.`id` = 2